1C_config/src/DataProcessors/ВыгрузкаПлатежейВБанк/ВыгрузкаПлатежейВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаПлатежейВБанк</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетОтправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

1C_config/src/Documents/ПлатежноеПоручение/ПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручение</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <attributes>
    <name>СчетОтправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучателя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
</mdclass:Document>

1C_config/src/DataProcessors/ВыгрузкаПлатежейВБанк/Forms/Форма1/Module.bsl
&НаКлиенте
Процедура ВыбратьФайл(Команда)
    
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt";
    Диалог.Заголовок = "Укажите файл для выгрузки";
    
    Если Диалог.Выбрать() Тогда
        Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
    
    // Проверки
    Если Объект.СчетОтправителя.Пустая() Тогда
        Объект.Результат = "Ошибка: не выбран счет!";
        Возврат;
    КонецЕсли;
    
    Если ПустаяСтрока(Объект.ПутьКФайлу) Тогда
        Объект.Результат = "Ошибка: не указан файл!";
        Возврат;
    КонецЕсли;
    
    // Выгружаем
    РезультатВыгрузки = ВыгрузитьНаСервере();
    Объект.Результат = РезультатВыгрузки;
    
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ПлатежноеПоручение.Номер,
    |    ПлатежноеПоручение.Дата,
    |    ПлатежноеПоручение.СчетОтправителя.Код КАК СчетОтправителя,
    |    ПлатежноеПоручение.СчетПолучателя.Код КАК СчетПолучателя,
    |    ПлатежноеПоручение.СчетПолучателя.Владелец.Наименование КАК Получатель,
    |    ПлатежноеПоручение.Сумма,
    |    ПлатежноеПоручение.НазначениеПлатежа
    |ИЗ
    |    Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
    |ГДЕ
    |    ПлатежноеПоручение.Дата МЕЖДУ &Нач И &Кон
    |    И ПлатежноеПоручение.СчетОтправителя = &Счет
    |    И ПлатежноеПоручение.Проведен = ИСТИНА";
    
    Запрос.УстановитьПараметр("Нач", Объект.НачалоПериода);
    Запрос.УстановитьПараметр("Кон", Объект.КонецПериода);
    Запрос.УстановитьПараметр("Счет", Объект.СчетОтправителя);
    
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        Возврат "Нет платежей за выбранный период";
    КонецЕсли;
    
    // Создаем текстовый документ
    ТекстДок = Новый ТекстовыйДокумент;
	
	// шапка
    ТекстДок.ДобавитьСтроку("1CClientBankExchange");
    ТекстДок.ДобавитьСтроку("ВерсияФормата=1.02");
    ТекстДок.ДобавитьСтроку("ДатаСоздания=" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd"));
    ТекстДок.ДобавитьСтроку("");
    
    // Добавляем платежи
    Счетчик = 0;
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        Счетчик = Счетчик + 1;
        
        ТекстДок.ДобавитьСтроку("СекцияДокумент=ПлатежноеПоручение");
        ТекстДок.ДобавитьСтроку("Номер=" + Выборка.Номер);
        ТекстДок.ДобавитьСтроку("Дата=" + Формат(Выборка.Дата, "ДФ=yyyyMMdd"));
        ТекстДок.ДобавитьСтроку("Сумма=" + Формат(Выборка.Сумма, "ЧДЦ=2"));
        ТекстДок.ДобавитьСтроку("ПлательщикСчет=" + Выборка.СчетОтправителя);
        ТекстДок.ДобавитьСтроку("ПолучательСчет=" + Выборка.СчетПолучателя);
        ТекстДок.ДобавитьСтроку("Получатель=" + Выборка.Получатель);
        ТекстДок.ДобавитьСтроку("НазначениеПлатежа=" + Выборка.НазначениеПлатежа);
        ТекстДок.ДобавитьСтроку("");
    КонецЦикла;
    
    ТекстДок.ДобавитьСтроку("КонецФайла");
    
    // Сохраняем
    Попытка
        ТекстДок.Записать(Объект.ПутьКФайлу, КодировкаТекста.ANSI);
        Возврат "✅ Выгружено документов: " + Счетчик + " в файл " + Объект.ПутьКФайлу;
    Исключение
        Возврат "❌ Ошибка записи файла: " + ОписаниеОшибки();
    КонецПопытки;
    
КонецФункции
